In [1]:
# importing libraries 
import pandas as pd
import numpy as np

In [2]:
# reading or loading the toyota file and displaying
toyota_dataset = pd.read_csv("gdap_cc_project/Datasets/Toyota.csv")
toyota_dataset

,Unnamed: 0,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
0,0,13500,23.0,46986,Diesel,90,1.0,0,2000,three,1165
1,1,13750,23.0,72937,Diesel,90,1.0,0,2000,3,1165
2,2,13950,24.0,41711,Diesel,90,NaN,0,2000,3,1165
3,3,14950,26.0,48000,Diesel,90,0.0,0,2000,3,1165
4,4,13750,30.0,38500,Diesel,90,0.0,0,2000,3,1170
...,...,...,...,...,...,...,...,...,...,...,...
1431,1431,7500,NaN,20544,Petrol,86,1.0,0,1300,3,1025
1432,1432,10845,72.0,??,Petrol,86,0.0,0,1300,3,1015
1433,1433,8500,NaN,17016,Petrol,86,0.0,0,1300,3,1015
1434,1434,7250,70.0,??,NaN,86,1.0,0,1300,3,1015
1435,1435,6950,76.0,1,Petrol,110,0.0,0,1600,5,1114

In [3]:
# making a copy of the dataset 
df = toyota_dataset.copy()

# Trying to have an overview of the dataset

In [4]:
# showing the first and last five rows
first_five = df.head
print(first_five)
last_five = df.tail()
print(last_five)

<bound method NDFrame.head of       Unnamed: 0  Price   Age     KM FuelType   HP  MetColor  Automatic    CC  \
0              0  13500  23.0  46986   Diesel   90       1.0          0  2000
1              1  13750  23.0  72937   Diesel   90       1.0          0  2000
2              2  13950  24.0  41711   Diesel   90       NaN          0  2000
3              3  14950  26.0  48000   Diesel   90       0.0          0  2000
4              4  13750  30.0  38500   Diesel   90       0.0          0  2000
...          ...    ...   ...    ...      ...  ...       ...        ...   ...
1431        1431   7500   NaN  20544   Petrol   86       1.0          0  1300
1432        1432  10845  72.0     ??   Petrol   86       0.0          0  1300
1433        1433   8500   NaN  17016   Petrol   86       0.0          0  1300
1434        1434   7250  70.0     ??      NaN   86       1.0          0  1300
1435        1435   6950  76.0      1   Petrol  110       0.0          0  1600

      Doors  Weight
0     three    1165
1         3    1165
2         3    1165
3         3    1165
4         3    1170
...     ...     ...
1431      3    1025
1432      3    1015
1433      3    1015
1434      3    1015
1435      5    1114

[1436 rows x 11 columns]>
      Unnamed: 0  Price   Age     KM FuelType   HP  MetColor  Automatic    CC  \
1431        1431   7500   NaN  20544   Petrol   86       1.0          0  1300
1432        1432  10845  72.0     ??   Petrol   86       0.0          0  1300
1433        1433   8500   NaN  17016   Petrol   86       0.0          0  1300
1434        1434   7250  70.0     ??      NaN   86       1.0          0  1300
1435        1435   6950  76.0      1   Petrol  110       0.0          0  1600

     Doors  Weight
1431     3    1025
1432     3    1015
1433     3    1015
1434     3    1015
1435     5    1114

In [5]:
# retrieving all column names
df.columns

Index(['Unnamed: 0', 'Price', 'Age', 'KM', 'FuelType', 'HP', 'MetColor',
       'Automatic', 'CC', 'Doors', 'Weight'],
      dtype='object')

In [6]:
# retrieving all column names
for column_names in df.columns:
    print(column_names)

Unnamed: 0
Price
Age
KM
FuelType
HP
MetColor
Automatic
CC
Doors
Weight

In [7]:
## retrieving the values of the Price column
df["Price"]

0       13500
1       13750
2       13950
3       14950
4       13750
        ...
1431     7500
1432    10845
1433     8500
1434     7250
1435     6950
Name: Price, Length: 1436, dtype: int64

In [8]:
#accesing a single value for Price column by their label and index
d = df.at[0, "Price"]
print(d)

13500

In [9]:
#accesing a single value for a column by their indices
df.iat[0,1]

np.int64(13500)

In [10]:
## accessing a group of rows and column by their index and label
df.loc[:5, "Price"] # first six values of the Price column

0    13500
1    13750
2    13950
3    14950
4    13750
5    12950
Name: Price, dtype: int64

In [ ]:
## accessing a group of rows and column by their indices only
df.iloc[:5, 1] # first six values of the Price column

In [11]:
#returns the size of the Toyota dataset
size = df.size
print(f' The Toyota dataset has {size} entries')

 The Toyota dataset has 15796 entries

In [12]:
# return the shape of the Toyota dataset
rows_columns = df.shape
print(f'the Toyota dataset has {rows_columns[0]} rows and {rows_columns[1]} columns')

the Toyota dataset has 1436 rows and 11 columns

In [13]:
## returning a concise summary of the Toyota dataset
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1436 entries, 0 to 1435
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  1436 non-null   int64
 1   Price       1436 non-null   int64
 2   Age         1336 non-null   float64
 3   KM          1436 non-null   object
 4   FuelType    1336 non-null   object
 5   HP          1436 non-null   object
 6   MetColor    1286 non-null   float64
 7   Automatic   1436 non-null   int64
 8   CC          1436 non-null   int64
 9   Doors       1436 non-null   object
 10  Weight      1436 non-null   int64
dtypes: float64(2), int64(5), object(4)
memory usage: 123.5+ KB

In [14]:
# returns the columns and their data types
df.dtypes

Unnamed: 0      int64
Price           int64
Age           float64
KM             object
FuelType       object
HP             object
MetColor      float64
Automatic       int64
CC              int64
Doors          object
Weight          int64
dtype: object

In [15]:
# return the number of unique value in each column in the Toyota dataset
df.nunique()

Unnamed: 0    1436
Price          236
Age             77
KM            1256
FuelType         3
HP              13
MetColor         2
Automatic        2
CC              12
Doors            7
Weight          59
dtype: int64

In [16]:
# return the number of missing value in each column
df.isnull().sum()

Unnamed: 0      0
Price           0
Age           100
KM              0
FuelType      100
HP              0
MetColor      150
Automatic       0
CC              0
Doors           0
Weight          0
dtype: int64

# DATA PRE-PROCESSING

In [17]:
df.head(20)

,Unnamed: 0,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
0,0,13500,23.0,46986,Diesel,90,1.0,0,2000,three,1165
1,1,13750,23.0,72937,Diesel,90,1.0,0,2000,3,1165
2,2,13950,24.0,41711,Diesel,90,NaN,0,2000,3,1165
3,3,14950,26.0,48000,Diesel,90,0.0,0,2000,3,1165
4,4,13750,30.0,38500,Diesel,90,0.0,0,2000,3,1170
5,5,12950,32.0,61000,Diesel,90,0.0,0,2000,3,1170
6,6,16900,27.0,??,Diesel,????,NaN,0,2000,3,1245
7,7,18600,30.0,75889,NaN,90,1.0,0,2000,3,1245
8,8,21500,27.0,19700,Petrol,192,0.0,0,1800,3,1185
9,9,12950,23.0,71138,Diesel,????,NaN,0,1900,3,1105
10,10,20950,25.0,31461,Petrol,192,0.0,0,1800,3,1185
11,11,19950,22.0,43610,Petrol,192,0.0,0,1800,3,1185
12,12,19600,25.0,32189,Petrol,192,0.0,0,1800,3,1185
13,13,21500,31.0,23000,Petrol,192,1.0,0,1800,3,1185
14,14,22500,32.0,34131,Petrol,192,1.0,0,1800,3,1185
15,15,22000,28.0,18739,Petrol,????,0.0,0,1800,3,1185
16,16,22750,30.0,34000,Petrol,192,1.0,0,1800,3,1185
17,17,17950,24.0,21716,Petrol,110,1.0,0,1600,3,1105
18,18,16750,24.0,25563,Petrol,110,0.0,0,1600,3,1065
19,19,16950,30.0,64359,Petrol,110,1.0,0,1600,3,1105

In [ ]:
df['Doors'].value_counts()

In [18]:
# replacing integers with string in the Doors column
df['Doors'] = df['Doors'].replace("three", 3)
df['Doors'] = df['Doors'].replace("four", 4)
df['Doors'] = df['Doors'].replace("five", 5)

In [19]:
# checking for the changes
df['Doors'].value_counts()

Doors
5    673
3    621
4    137
2      2
3      1
4      1
5      1
Name: count, dtype: int64

In [22]:
# changing the datatype to int
df['Doors'] = df['Doors'].astype(int)

In [23]:
# checking again
df['Doors'].value_counts()

Doors
5    674
3    622
4    138
2      2
Name: count, dtype: int64

In [21]:
df.head(20)

,Unnamed: 0,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
0,0,13500,23.0,46986,Diesel,90,1.0,0,2000,3,1165
1,1,13750,23.0,72937,Diesel,90,1.0,0,2000,3,1165
2,2,13950,24.0,41711,Diesel,90,NaN,0,2000,3,1165
3,3,14950,26.0,48000,Diesel,90,0.0,0,2000,3,1165
4,4,13750,30.0,38500,Diesel,90,0.0,0,2000,3,1170
5,5,12950,32.0,61000,Diesel,90,0.0,0,2000,3,1170
6,6,16900,27.0,??,Diesel,????,NaN,0,2000,3,1245
7,7,18600,30.0,75889,NaN,90,1.0,0,2000,3,1245
8,8,21500,27.0,19700,Petrol,192,0.0,0,1800,3,1185
9,9,12950,23.0,71138,Diesel,????,NaN,0,1900,3,1105
10,10,20950,25.0,31461,Petrol,192,0.0,0,1800,3,1185
11,11,19950,22.0,43610,Petrol,192,0.0,0,1800,3,1185
12,12,19600,25.0,32189,Petrol,192,0.0,0,1800,3,1185
13,13,21500,31.0,23000,Petrol,192,1.0,0,1800,3,1185
14,14,22500,32.0,34131,Petrol,192,1.0,0,1800,3,1185
15,15,22000,28.0,18739,Petrol,????,0.0,0,1800,3,1185
16,16,22750,30.0,34000,Petrol,192,1.0,0,1800,3,1185
17,17,17950,24.0,21716,Petrol,110,1.0,0,1600,3,1105
18,18,16750,24.0,25563,Petrol,110,0.0,0,1600,3,1065
19,19,16950,30.0,64359,Petrol,110,1.0,0,1600,3,1105

In [27]:
# replacing the missing value in Age with mean age
mean_age = df["Age"].mean().round(0)
mean_age

np.float64(56.0)

In [28]:
df["Age"] = df["Age"].fillna(56.0)
df["Age"]

0       23.0
1       23.0
2       24.0
3       26.0
4       30.0
        ...
1431    56.0
1432    72.0
1433    56.0
1434    70.0
1435    76.0
Name: Age, Length: 1436, dtype: float64

In [29]:
# checking for missing values
df["Age"].isnull().sum()

np.int64(0)

In [58]:
# dealing with the KM column
# replacing all ?? with NaN
df['KM'] = df['KM'].replace("??", np.nan)
df['KM'].value_counts()

KM
1.0        8
59000.0    7
36000.0    7
43000.0    7
10000.0    6
          ..
63635.0    1
63792.0    1
64193.0    1
65170.0    1
17016.0    1
Name: count, Length: 1255, dtype: int64

In [56]:
# changing the KM datatype to float
df["KM"] = df["KM"].astype(float)

np.float64(68647.23997185081)

In [57]:
# replacing the NaN in KM with mean 
mean_km = df['KM'].mean()
mean_km # looking at the mean value we need to confirm the first value i.e 1.0 to be able to make further changes

np.float64(68647.23997185081)

In [87]:
# dealing with FuelType column
# replacing missing values with Petrol
df["FuelType"] = df["FuelType"].fillna("Petrol")
df["FuelType"].isnull().sum()

np.int64(0)

In [88]:
df["FuelType"].value_counts()

FuelType
Petrol    1277
Diesel     144
CNG         15
Name: count, dtype: int64

In [68]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1436 entries, 0 to 1435
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  1436 non-null   int64
 1   Price       1436 non-null   int64
 2   Age         1436 non-null   float64
 3   KM          1421 non-null   float64
 4   FuelType    1436 non-null   object
 5   HP          1436 non-null   object
 6   MetColor    1286 non-null   float64
 7   Automatic   1436 non-null   int64
 8   CC          1436 non-null   int64
 9   Doors       1436 non-null   int64
 10  Weight      1436 non-null   int64
dtypes: float64(3), int64(6), object(2)
memory usage: 123.5+ KB

In [71]:
# dealing with HP column
df["HP"].value_counts()

HP
110     833
86      249
97      164
72       72
90       35
69       33
107      21
192      10
116       9
????      6
98        2
71        1
73        1
Name: count, dtype: int64

In [75]:
# replace ?? with NaN
df["HP"] = df["HP"].replace("????", np.nan)
df["HP"].value_counts()

HP
110    833
86     249
97     164
72      72
90      35
69      33
107     21
192     10
116      9
98       2
71       1
73       1
Name: count, dtype: int64

In [90]:
# replace the NaN WITH 110
df["HP"] = df["HP"].fillna(110)

In [92]:
#dealing with MetColor
# checking for No. of missing values
df["MetColor"].isnull().sum()

np.int64(150)

In [93]:
# dealing with Automatic
# checking for the frequency of each entry
df["MetColor"].value_counts() # since we have more NaN i.e 150 we need more info to fill the NaN with 1.0 or 0.0

MetColor
1.0    868
0.0    418
Name: count, dtype: int64

In [83]:
# dealing with Automatic 
# checking for null values
df["Automatic"].isnull().sum()

np.int64(0)

In [84]:
# CC
df["CC"].value_counts()

CC
1600    846
1300    248
1400    164
2000    119
1900     30
1800     14
1598      4
1587      4
1995      2
1398      2
1332      2
1975      1
Name: count, dtype: int64

In [85]:
#  Weight
df["Weight"].value_counts()

Weight
1075    192
1050    168
1015    117
1035    106
1070     89
1025     70
1065     51
1080     47
1055     43
1060     40
1085     40
1100     40
1115     39
1110     38
1040     35
1135     33
1105     31
1045     31
1130     29
1030     24
1000     17
1120     17
1140     16
1090     10
1114     10
1020      9
1185      9
1165      8
1150      7
1255      7
1180      5
1260      5
1170      4
1095      4
1480      4
1205      4
1010      4
1270      3
1320      3
1119      3
1245      3
1195      2
1275      2
1155      2
1160      1
1109      1
1079      1
1172      1
1094      1
1084      1
1103      1
1078      1
1280      1
1265      1
1125      1
1067      1
1615      1
1121      1
1083      1
Name: count, dtype: int64

In [86]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1436 entries, 0 to 1435
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  1436 non-null   int64
 1   Price       1436 non-null   int64
 2   Age         1436 non-null   float64
 3   KM          1421 non-null   float64
 4   FuelType    1436 non-null   object
 5   HP          1430 non-null   object
 6   MetColor    1286 non-null   float64
 7   Automatic   1436 non-null   int64
 8   CC          1436 non-null   int64
 9   Doors       1436 non-null   int64
 10  Weight      1436 non-null   int64
dtypes: float64(3), int64(6), object(2)
memory usage: 123.5+ KB

In [91]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1436 entries, 0 to 1435
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  1436 non-null   int64
 1   Price       1436 non-null   int64
 2   Age         1436 non-null   float64
 3   KM          1421 non-null   float64
 4   FuelType    1436 non-null   object
 5   HP          1436 non-null   object
 6   MetColor    1286 non-null   float64
 7   Automatic   1436 non-null   int64
 8   CC          1436 non-null   int64
 9   Doors       1436 non-null   int64
 10  Weight      1436 non-null   int64
dtypes: float64(3), int64(6), object(2)
memory usage: 123.5+ KB